//
//  QuizList.swift
//  QuizSampleApp
//
//  Created by 高橋直也 on 2019/10/26.
//  Copyright © 2019 高橋直也. All rights reserved.
//

import Foundation


struct quizList1 {
    let caseTitle = "レッスン1"
    let quizID: [Int] = [1,2,3,4,5]
    let question: [String] = ["ジャック・クイーン・キングといえばトランプ。では鹿・イノシシ・チョウチョといえば何？","国立大学を一般受験する人は受ける全国一斉テストのことを何試験というでしょう？","人体の中で外側をエナメル質がおおっているのはどこ？","陸上でリレー競技の最後の走者のことをなんと言う？","他人の物が良く見えてしまうたとえ。「となりの何は青い」という？"]
    let choiceAnswer: [[String]] = [["花札","生物","動物"],["セカンド試験","サード試験","センター試験"],["爪","目","歯"],["アンカー","バンカー","ラストランナー"],["芝","柴","鹿"]]
    let anser: [String] = ["花札","センター試験","歯","アンカー","芝"]

}

struct quizList2 {
    let caseTitle = "レッスン2"
    let quizID: [Int] = [1,2,3,4,5]
    let question: [String] = ["ジャック・クイーン・キングといえばトランプ。では鹿・イノシシ・チョウチョといえば何？","国立大学を一般受験する人は受ける全国一斉テストのことを何試験というでしょう？","人体の中で外側をエナメル質がおおっているのはどこ？","陸上でリレー競技の最後の走者のことをなんと言う？","他人の物が良く見えてしまうたとえ。「となりの何は青い」という？"]
    let choiceAnswer: [[String]] = [["花札","生物","動物"],["セカンド試験","サード試験","センター試験"],["爪","目","歯"],["アンカー","バンカー","ラストランナー"],["芝","柴","鹿"]]
    let anser: [String] = ["花札","センター試験","歯","アンカー","芝"]

}
